class EvaluationController < ApplicationController
  def index
    @data_1 = [
      ["бюджетний", "середній", "бюджетний", "дорогий"],
      ["седан", "кросовер", "хетчбек", "седан"],
      ["бензин", "бензин", "гібрид", "електро"],
      [500, 700, 500, 700],
      [122, 150, 125, 353],
      [471, 615, 375, 425],
      ["5", "5", "5", "5"],
      ["механіка", "автомат", "механіка", "автомат"],
      ["негативні", "позитивні", "негативні", "позитивні"]
    ]

    @inputs = [
      %w[дорогий середній бюджетний],
      %w[седан кросовер хетчбек універсал],
      %w[бензин дизель гібрид електро],
      nil,
      nil,
      nil,
      %w[5 7],
      %w[механіка автомат],
      %w[негативні позитивні]
    ]
  end

  def multicriteria

  end
end
